examples/flows/agentic/compiled/routing_classifier/flow.mmd
flowchart TD
    %% Flow: routing_classifier

    account_agent[account_agent]
    billing_agent[billing_agent]
    classifier[classifier]
    format_reply[format_reply]
    general_agent[general_agent]
    router_routing_classifier_line_47_if_3{{router_routing_classifier_line_47_if_3}}
    router_routing_classifier_line_49_if_2{{router_routing_classifier_line_49_if_2}}
    router_routing_classifier_line_51_if_1{{router_routing_classifier_line_51_if_1}}
    start_routing_classifier([start_routing_classifier])
    technical_agent[technical_agent]
    __end__((( )))

    start_routing_classifier --> classifier
    classifier --> router_routing_classifier_line_47_if_3
    router_routing_classifier_line_51_if_1 -->|p.get('category') == 'account'| account_agent
    router_routing_classifier_line_51_if_1 -->|not (p.get('category') == 'account')| general_agent
    router_routing_classifier_line_49_if_2 -->|p.get('category') == 'technical'| technical_agent
    router_routing_classifier_line_49_if_2 -->|not (p.get('category') == 'technical')| router_routing_classifier_line_51_if_1
    router_routing_classifier_line_47_if_3 -->|p.get('category') == 'billing'| billing_agent
    billing_agent --> format_reply
    router_routing_classifier_line_47_if_3 -->|not (p.get('category') == 'billing')| router_routing_classifier_line_49_if_2
    technical_agent --> format_reply
    router_routing_classifier_line_51_if_1 --> format_reply
    account_agent --> __end__
    format_reply --> __end__
    general_agent --> __end__
